
const { KintoneRestAPIClient } = require("@kintone/rest-api-client");
const client = new KintoneRestAPIClient();


(function(){
  'use strict';

  const vm = new Vue({
    vuetify: new Vuetify(),
    data() {
      return {
        client: client,
      }
    }
  });

// ********************************************************************************************************************************
// kintoneイベントハンドラ
// ********************************************************************************************************************************
  // ========================================================================================================
  // 一覧画面
  // ========================================================================================================
  kintone.events.on(['app.record.index.show'], async function(event) {
    /** *******************************************************************************
     * セグメント配信一覧
     ******************************************************************************* */
    if (event.viewId == 5690398) {
      // お知らせメッセージ表示
      Swal.fire({
          title: 'セグメント配信一覧',
          html: '一覧を絞り込んだうえで<br>セグメント配信ボタンを押してください。',
          icon: 'info',
          button: 'OK'
      });
    }


    /** *******************************************************************************
     * カスタマイズ一覧
     * - LINEターゲット配信
     ******************************************************************************* */
    else if (event.viewId == 5700739) {
      const appEl = document.getElementById('app');
      const vAppEl = document.createElement('v-app');
      vAppEl.innerHTML = `<tc-param :client="client"></tc-param>`;
      appEl.appendChild(vAppEl);

      vm.$mount('#app');
    }

    return event;
  });

  // ========================================================================================================
  // 詳細画面
  // ========================================================================================================
  kintone.events.on(['app.record.detail.show'], function(event) {
    var record = event.record;
    return event;
  });

  // ========================================================================================================
  // 入力画面
  // ========================================================================================================
  kintone.events.on(['app.record.create.show', 'app.record.edit.show'], function(event) {
    var record = event.record;
    return event;
  });
})();


